---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveTooShort
source: html/83deaccf-a4a8-3e4d-837d-d0fa5d9f8d12.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveTooShort Property

Line is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveTooShort { get; }
```